Revit 2027 API
ViewSheet.GetRevisionNumberOnSheet Method
 Gets the Revision Number for a particular Revision as it will appear on this sheet.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetRevisionNumberOnSheet(
	ElementId revisionId
)
Public Function GetRevisionNumberOnSheet (
	revisionId As ElementId
) As String
public:
String^ GetRevisionNumberOnSheet(
	ElementId^ revisionId
)
member GetRevisionNumberOnSheet :
        revisionId : ElementId -> string
Parameters
revisionId ElementId
 The id of the Revision.
Return Value
String
 Returns the Revision Number as it will appear on this sheet or null if the Revision does not appear on this sheet.
Exceptions
Exception | Condition
ArgumentException |  revisionId is not a valid Revision.
ArgumentNullException |  A non-optional argument was null
Remarks
 Returns null if the Revision does not appear on this sheet.
See Also
Reference
ViewSheet Class
Autodesk.Revit.DB Namespace